{
  "articles": [
    {
      "articleId": "102b452ff9fe367dc9e251dc6aa4ef2d",
      "sourceType": "RSS",
      "sourceName": "아사히 신문",
      "categoryCode": "world",
      "url": "http://www.asahi.com/articles/ASTDM3RKYTDMUTIL03FM.html?ref=rss",
      "title": "節電で真っ暗だった銀座と新宿、15年後の今を歩く　進む脱・脱原発",
      "content": "",
      "publishedAt": "2025-12-22T15:27:11.237886+09:00"
    },
    {
      "articleId": "e3e5ad1bcf61fe52a0b15a6a58f6b098",
      "sourceType": "RSS",
      "sourceName": "아사히 신문",
      "categoryCode": "world",
      "url": "http://www.asahi.com/articles/ASTDL3RFZTDLOXIE042M.html?ref=rss",
      "title": "外国人めぐる「不安」、実態は　ヘイトスピーチ研究者が語った対策",
      "content": "",
      "publishedAt": "2025-12-22T15:27:11.237886+09:00"
    },
    {
      "articleId": "10c9615b32b3e8699375849d601b3c82",
      "sourceType": "RSS",
      "sourceName": "아사히 신문",
      "categoryCode": "world",
      "url": "http://www.asahi.com/articles/ASTDB3J92TDBPTIL006M.html?ref=rss",
      "title": "【そもそも解説】外国人への「仮放免」とは　どう生活？強制送還は？",
      "content": "",
      "publishedAt": "2025-12-22T15:27:11.237886+09:00"
    },
    {
      "articleId": "cb6e0e2c5884ea743d2f6e19d7e10057",
      "sourceType": "RSS",
      "sourceName": "재팬 타임즈",
      "categoryCode": "world",
      "url": "https://www.japantimes.co.jp/sports/2025/12/22/more-sports/nfl-steelers-lions-playoff-picture/",
      "title": "Steelers edge Lions as Bears and 49ers secure playoff berths",
      "content": "Pittsburgh's win means the Chicago Bears and San Francisco 49ers clinched spots in the playoffs.",
      "publishedAt": "2025-12-22T14:35:00+09:00"
    },
    {
      "articleId": "1a3e363424618a1bf41827a3e04f11d6",
      "sourceType": "RSS",
      "sourceName": "재팬 타임즈",
      "categoryCode": "world",
      "url": "https://www.japantimes.co.jp/sports/2025/12/22/soccer/salah-focused-afon-not-liverpool/",
      "title": "Salah focused on Egypt ambition with Liverpool crisis behind him",
      "content": "Egypt captain Mohamed Salah has put aside his travails at Liverpool and is focused on having success at the Africa Cup of Nations with his national team, coach Hossam Hassan said on Sunday.",
      "publishedAt": "2025-12-22T14:34:00+09:00"
    },
    {
      "articleId": "45504d01f6ce5750b26e04a582bdc333",
      "sourceType": "RSS",
      "sourceName": "재팬 타임즈",
      "categoryCode": "world",
      "url": "https://www.japantimes.co.jp/news/2025/12/22/asia-pacific/hong-kong-china-film-censorship/",
      "title": "Banned film exposes Hong Kong’s censorship trend, director says",
      "content": "“If it involves Hong Kong’s real political situation, absolutely no one will make a movie about it,” says Deadline director Kiwi Chow.",
      "publishedAt": "2025-12-22T14:31:00+09:00"
    },
    {
      "articleId": "5363d2ab3585ba7599b15023a39b2c4a",
      "sourceType": "RSS",
      "sourceName": "Japan Today",
      "categoryCode": "world",
      "url": "https://japantoday.com/category/world/trump-announces-he%27s-appointing-louisiana-gov.-jeff-landry-to-serve-as-us-special-envoy-to-greenland",
      "title": "Trump announces appoints Louisiana Gov Jeff Landry to serve as U.S. special envoy to Greenland",
      "content": "President Donald Trump ‍on Sunday ​announced ​he ⁠is appointing Louisiana Gov Jeff Landry to serve as the U.S. ‌special envoy to Greenland, the vast, semi-autonomous territory of Denmark…",
      "publishedAt": "2025-12-22T04:15:47+00:00"
    },
    {
      "articleId": "858f9ca00dec721c15a9b7f4ce76368a",
      "sourceType": "RSS",
      "sourceName": "Japan Today",
      "categoryCode": "world",
      "url": "https://japantoday.com/category/world/australian-state-parliament-reconvenes-to-push-through-stricter-gun-laws-after-bondi-mass-shooting1",
      "title": "Australian state parliament to push through stricter gun laws after Bondi mass shooting",
      "content": "The parliament of Australia's New South Wales state was recalled on Monday to vote on proposed new laws that would impose major curbs on firearm ownership, ban the…",
      "publishedAt": "2025-12-22T06:10:59+00:00"
    },
    {
      "articleId": "4c6adb49a5a1a989f48d4248dfcd2488",
      "sourceType": "RSS",
      "sourceName": "Japan Today",
      "categoryCode": "world",
      "url": "https://japantoday.com/category/world/us-envoy-witkoff-calls-ukraine-talks-productive",
      "title": "U.S. envoy Witkoff calls Ukraine talks productive",
      "content": "Talks held between U.S., European and Ukrainian officials over the last three days in Florida aimed at ending Russia's war ‌in Ukraine were productive and focused on aligning…",
      "publishedAt": "2025-12-22T03:30:16+00:00"
    },
    {
      "articleId": "96f6a69f586a0c2afb064ede1e53d738",
      "sourceType": "RSS",
      "sourceName": "SoraNews",
      "categoryCode": "world",
      "url": "https://soranews24.com/2025/12/22/large-amount-of-supposed-human-organs-left-in-osaka-marketplace/",
      "title": "Large amount of supposed human organs left in Osaka marketplace",
      "content": "One person’s trash is another’s nightmare.We sometimes hear stories of people lucky enough to find incredibly valuable items or straight-uppiles of cashamong piles of garbage. However, the opposite is also true, in which people find things far worse than the usual watermelon rinds, egg shells, and even dirty diapers.Such a case occurred last September, whenseveral glass jars containing what are believed to be human organs were found left in cardboard boxes on the premises of the Osaka Municipal Wholesale Market. There was said to be a “large amount” of these jars, described as similar to those used for jam or coffee, though that would seem to imply that there’s also somehow a “normal” amount of containers with human flesh. What are believed to be peoples’ names were also written on each jar.A worker in charge of cleaning for the market was the first to discover the boxes and said they didn’t resemble organs exactly, but looked more like tissue that might have been removed during surger",
      "publishedAt": "2025-12-22T04:00:58+00:00"
    },
    {
      "articleId": "d254724b0b8bd078fe6f7241ea26b7a7",
      "sourceType": "RSS",
      "sourceName": "SoraNews",
      "categoryCode": "world",
      "url": "https://soranews24.com/2025/12/22/proposed-sakura-name-for-new-middle-school-in-japan-draws-complaints-for-kamikaze-overlap/",
      "title": "Proposed sakura name for new middle school in Japan draws complaints for kamikaze overlap",
      "content": "This isn’t the cherry blossom image the committee was going for.As Japan’s population shrinks and housing densities shift, sometimes the decision is made to merge two preexisting schools into a single new one. That’s what’s on the schedule for Hakko Middle School and Amagi Middle School, a pair of public schools inOmuta, a city inFukuoka Prefecturewith a population of around 105,000 people.Since this is meant as a merger of equals, not one school absorbing the other,the local board of education wants to retire both schools’ names and give the combined institution a new moniker. For that purpose,a committee was formed by the two schools’ principals and PTAs, which then solicited suggestions from students and residents of the city. A total of 340 names were suggested, and after internal discussion and voting, the committee made its recommendation to the Omuta municipal board of education on December 17:Ohka Middle School.At first glance, Ohka might seem like a very fitting name for a sch",
      "publishedAt": "2025-12-22T02:00:54+00:00"
    },
    {
      "articleId": "02867f3dcd028ce025262e9b1afe4972",
      "sourceType": "RSS",
      "sourceName": "SoraNews",
      "categoryCode": "world",
      "url": "https://soranews24.com/2025/12/21/starbucks-on-a-shinkansen-bullet-train-platform-5-tips-for-using-the-unstaffed-store-in-japan/",
      "title": "Starbucks on a Shinkansen bullet train platform: 6 tips for using the automated store in Japan",
      "content": "Essential pointers to ensure you get your coffee without missing your train.Last month, Starbucks opened its first-ever store on a Shinkansen bullet train platform, atShin-Yokohama Station. Located onthe Tokaido Shinkansen’s outbound platform 11, the new store makes the chain’s coffee-to-go more convenient than ever for rail travellers, and even if you’re not catching a train, you can try it out by purchasing an entry ticket, either via the station’s ticket machines (look for “入場券” (“nyuujouken”) or by requesting it from rail staff (simply say “nyuujouken o onegaishimasu“).This new Starbucks goes by the official name “JR Shin-Yokohama Station Shinkansen Outbound Platform No. 11 Store“, and is locatednear car 11 on the outbound Shinkansen platform.▼ The store, marked by its green exterior, instantly grabs your attention.As the first Starbucks to ever be located on a Shinkansen platform,this branch has a number of features that make it different from other stores. There can be a bit of a",
      "publishedAt": "2025-12-21T13:00:07+00:00"
    },
    {
      "articleId": "f1265aa23d903b6b79980a9095049c37",
      "sourceType": "RSS",
      "sourceName": "News On Japan",
      "categoryCode": "world",
      "url": "https://newsonjapan.com/article/147958.php",
      "title": "Kyoto University Shortlisted for International Research Excellence",
      "content": "Kyoto University has been selected as a candidate for designation as an “University of International Research Excellence,” a national program that provides government funding to institutions aiming to conduct world-class research. (News On Japan)",
      "publishedAt": "2025-12-20T15:37:43+09:00"
    },
    {
      "articleId": "4b1b19bf1db0f20258de64436f5eb97b",
      "sourceType": "RSS",
      "sourceName": "News On Japan",
      "categoryCode": "world",
      "url": "https://newsonjapan.com/article/147957.php",
      "title": "Suspect Admits Intent to Kill Several HKT Members",
      "content": "A man arrested in connection with the stabbing of two people in Fukuoka has told investigators that he intended to kill multiple members of the idol group HKT, according to sources close to the investigation. (News On Japan)",
      "publishedAt": "2025-12-20T15:35:42+09:00"
    },
    {
      "articleId": "54796806cb427a654081f8b217324f7c",
      "sourceType": "RSS",
      "sourceName": "News On Japan",
      "categoryCode": "world",
      "url": "https://newsonjapan.com/article/147954.php",
      "title": "Japan’s Rate Hike Deepens Generational Divide Between Savers And Homebuyers",
      "content": "The Bank of Japan has decided to raise its policy interest rate to around 0.75 percent, a level not seen in 30 years, prompting questions about how the move will affect the weak yen, rising prices, and household finances across different generations. (News On Japan)",
      "publishedAt": "2025-12-20T06:33:46+09:00"
    },
    {
      "articleId": "f738e294ff4f8e1e993d7ca85c3b14cb",
      "sourceType": "RSS",
      "sourceName": "NHK",
      "categoryCode": "world",
      "url": "http://www3.nhk.or.jp/news/html/20251222/k10015009941000.html",
      "title": "H3ロケット みちびき5号機搭載 打ち上げ失敗",
      "content": "日本版GPS衛星「みちびき5号機」を搭載したH3ロケット8号機は、22日午前、鹿児島県の種子島宇宙センターから打ち上げられましたが、JAXA＝宇宙航空研究開発機構によりますと、2段目のロケットのエンジンが予定よりも早く燃焼を停止し、打ち上げは失敗しました。",
      "publishedAt": "2025-12-22T15:18:33+09:00"
    },
    {
      "articleId": "03f3813f51903b6173935e714f163cc0",
      "sourceType": "RSS",
      "sourceName": "NHK",
      "categoryCode": "world",
      "url": "http://www3.nhk.or.jp/news/html/20251222/k10015010161000.html",
      "title": "静岡 長泉町で強盗 “約1000万円奪われた”就寝中に襲われたか",
      "content": "22日未明、静岡県長泉町の店舗を兼ねた住宅で80代の夫婦が押し入った複数の男らにテープで縛られ現金を奪われた事件で、夫婦は2階で寝ていたときに襲われたことがわかりました。夫婦は「およそ1000万円を奪われた」と話しているということで、警察が強盗事件として捜査しています。",
      "publishedAt": "2025-12-22T12:28:12+09:00"
    },
    {
      "articleId": "4e630310986714754c3c8b68fcca6d70",
      "sourceType": "RSS",
      "sourceName": "NHK",
      "categoryCode": "world",
      "url": "http://www3.nhk.or.jp/news/html/20251222/k10015010251000.html",
      "title": "徳島市 生活保護申請者らに賞味期限切れ食品支給 同意書求める",
      "content": "生活保護の申請者や受給者のうちその日の食料に困るなど緊急支援が必要な人に対し、徳島市が、賞味期限切れの備蓄食品を支給し、その際、「体調が悪くなった場合、自己責任」とする同意書にサインさせていたことがわかりました。徳島市はNHKの取材を受けて「不適切だった」として、こうした対応を取りやめたとしています。",
      "publishedAt": "2025-12-22T11:50:17+09:00"
    }
  ]
}